### Question :-  Explain dimension reduction in machine learning.

**Answer**
> Dimensionality reduction is a feature selection technique using which we reduce the number of features to be used for making a model without losing a significant amount of information compared to the original dataset. In other words, a dimensionality reduction technique projects a data of higher dimension to a lower-dimensional subspace.

**When to use Dimensionality Reduction?**

-- Dimensionality reduction shall be used before feeding the data to a machine learning algorithm to achieve the following:


- It reduces the size of the space in which the distances are calculated, thereby improving machine learning algorithm performance.
- It reduces the degrees of freedom for our dataset avoiding chances of overfitting
- Reducing the dimensionality using dimensionality reduction techniques can simplify the dataset facilitating a better description, visualisation, and insight.

### Different types of dimension reduction technique.
- Ratio of missing values
- Low variance in the column values
- High correlation between two columns
- **Principal component analysis (PCA)**
- Candidates and split columns in a random forest
- Backward feature elimination
- Forward feature construction
- Linear discriminant analysis (LDA)
- Neural autoencoder
- t-distributed stochastic neighbor embedding (t-SNE)

### Question 2:- How can you handle duplicate values in a dataset for a variable in Python using pandas?

I will explain you by taking a dataset.
Let's create a dataset using pandas

In [2]:
import pandas as pd

In [19]:
data = pd.DataFrame({"Name":['Alankar', 'Vijay', 'Alankar', 'Vijay'], 'Age':[12, 13, 12, 13]})

print('Duplicate dataset is created')
data

Duplicate dataset is created

      Name  Age
0  Alankar   12
1    Vijay   13
2  Alankar   12
3    Vijay   13

In [20]:
print('Let\'s drop the duplicate values from our dataframe')
## So for dropping the duplicate values we ae goimg to use pandas 'drop_duplicates function'

Let's drop the duplicate values from our dataframe

In [21]:
updated_data = data.drop_duplicates()

##### Before dropping the duplicate values

In [22]:
data

      Name  Age
0  Alankar   12
1    Vijay   13
2  Alankar   12
3    Vijay   13

##### After dropping the duplicate values

In [23]:
updated_data

      Name  Age
0  Alankar   12
1    Vijay   13